Revit 2024 API
WallSide Enumeration
 Represents the possible sides of a wall where a sweep or reveal may be attached.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public enum WallSide
Visual Basic
Public Enumeration WallSide
Visual C++
public enum class WallSide
Members
Member name | Description
Exterior |  The exterior of the wall.
Interior |  The interior of the wall.
See Also
Autodesk.Revit.DB Namespace